src/InformationRegisters/ABCXYZКлассификацияКлиентов/ABCXYZКлассификацияКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ABCXYZКлассификацияКлиентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Класс</name>
    <type>
      <types>EnumRef.XYZКлассификация</types>
      <types>EnumRef.ABCКлассификация</types>
      <types>EnumRef.СтадииВзаимоотношенийСКлиентами</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПараметраКлассификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПараметраКлассификации</name>
    <type>
      <types>EnumRef.ТипыПараметровКлассификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКлассификации</name>
    <type>
      <types>EnumRef.ТипыКлассификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыКлассификации/ТипыКлассификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКлассификации</name>
  <enumValues>
    <name>ABC</name>
  </enumValues>
  <enumValues>
    <name>XYZ</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/ABCXYZКлассификацияКлиентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Очищает всю информацию ABC-классификаци клиентов.
Процедура ОчиститьABCКлассификацию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ABCXYZКлассификацияКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТипКлассификации.Установить(Перечисления.ТипыКлассификации.ABC);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Очищает всю информацию XYZ-классификаци клиентов.
Процедура ОчиститьXYZКлассификацию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ABCXYZКлассификацияКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТипКлассификации.Установить(Перечисления.ТипыКлассификации.XYZ);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
